In [ ]:
## 시꼐열 데이터 다루기

## 시계열 데이터 다루기

In [2]:
from datetime import datetime #datetime 하나의 날짜 자료형

date1 = datetime(2023, 9, 12)
date1

datetime.datetime(2023, 9, 12, 0, 0)

In [6]:
date2 = datetime(2023, 9, 12, 22, 30) # 년 월 일 시 분 초
date2

datetime.datetime(2023, 9, 12, 22, 30)

In [9]:
print(date2.year) #alt shift 아래 문장 통쨰로 복사
print(date2.month)
print(date2.day)
print(date2.hour)
print(date2.weekday())  # 월요일 : 0

2023
9
12
22
1

In [8]:
print(date2.weekday()) # 월요일 : 0
print(date2.quarter)

1

AttributeError: 'datetime.datetime' object has no attribute 'quarter'

In [10]:
import pandas as pd
date3 = '2023-09-12'
datetime_date3 = pd.to_datetime(date3)
print(datetime_date3.year)

2023

In [ ]:
datetime_date3

## 데이터를 년월별로 묶고 싶다. ex) 201201, 201202, 201203

In [11]:
AAPL = pd.read_csv('https://raw.githubusercontent.com/jin0choi1216/dataset/main/AAPL.csv')
AAPL.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2012-01-03,14.621429,14.732143,14.607143,14.686786,12.466090,302220800
1,2012-01-04,14.642857,14.810000,14.617143,14.765714,12.533089,260022000
2,2012-01-05,14.819643,14.948214,14.738214,14.929643,12.672229,271269600
3,2012-01-06,14.991786,15.098214,14.972143,15.085714,12.804703,318292800
4,2012-01-09,15.196429,15.276786,15.048214,15.061786,12.784389,394024400

In [ ]:
#datetime_date3.strftime('시간자료형을 나타내는 포멧')
#네자리수 연도 %Y
#월은 %m

# %Y%m%d %H:%M:%S
# 년 월 일 시  분 초

In [12]:
date4 = '23-01-01' #2023-01-01
pd.to_datetime(date4, format = '%y-%m-%d')

Timestamp('2023-01-01 00:00:00')

In [ ]:
date5 = '2/2/2020' #월/일/년
date6 =  'Jan 01, 2018'  # 월 일, 년

In [17]:
date5 ='2/2/2020' #2023-01-01
pd.to_datetime(date5, format = '%d/%m/%Y')

Timestamp('2020-02-02 00:00:00')

In [27]:
date6 ='Jan 01, 2018' #2023-01-01
pd.to_datetime(date6, format ='%b %d, %Y') # %b 3자리수 자료형 월

Timestamp('2018-01-01 00:00:00')

In [29]:
date1.strftime('%Y년 %m월 %d일')

AttributeError: 'str' object has no attribute 'strftime'

In [30]:
AAPL = pd.read_csv('https://raw.githubusercontent.com/jin0choi1216/dataset/main/AAPL.csv')
AAPL.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2012-01-03,14.621429,14.732143,14.607143,14.686786,12.466090,302220800
1,2012-01-04,14.642857,14.810000,14.617143,14.765714,12.533089,260022000
2,2012-01-05,14.819643,14.948214,14.738214,14.929643,12.672229,271269600
3,2012-01-06,14.991786,15.098214,14.972143,15.085714,12.804703,318292800
4,2012-01-09,15.196429,15.276786,15.048214,15.061786,12.784389,394024400

In [31]:
AAPL.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2931 entries, 0 to 2930
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       2931 non-null   object
 1   Open       2931 non-null   float64
 2   High       2931 non-null   float64
 3   Low        2931 non-null   float64
 4   Close      2931 non-null   float64
 5   Adj Close  2931 non-null   float64
 6   Volume     2931 non-null   int64
dtypes: float64(5), int64(1), object(1)
memory usage: 160.4+ KB

In [34]:
AAPL['Date'] = pd.to_datetime(AAPL['Date']) # DATE의 값들을 datetime형으로 변환

In [35]:
AAPL.info

<bound method DataFrame.info of            Date        Open        High         Low       Close   Adj Close  \
0    2012-01-03   14.621429   14.732143   14.607143   14.686786   12.466090
1    2012-01-04   14.642857   14.810000   14.617143   14.765714   12.533089
2    2012-01-05   14.819643   14.948214   14.738214   14.929643   12.672229
3    2012-01-06   14.991786   15.098214   14.972143   15.085714   12.804703
4    2012-01-09   15.196429   15.276786   15.048214   15.061786   12.784389
...         ...         ...         ...         ...         ...         ...
2926 2023-08-21  175.070007  176.130005  173.740005  175.839996  175.839996
2927 2023-08-22  177.059998  177.679993  176.250000  177.229996  177.229996
2928 2023-08-23  178.520004  181.550003  178.330002  181.119995  181.119995
2929 2023-08-24  180.669998  181.100006  176.009995  176.380005  176.380005
2930 2023-08-25  177.380005  179.149994  175.820007  178.610001  178.610001

         Volume
0     302220800
1     260022000
2     271269600
3     318292800
4     394024400
...         ...
2926   46311900
2927   42084200
2928   52722800
2929   54945800
2930   51418700

[2931 rows x 7 columns]>

In [36]:
AAPL['Date'].dt.year

0       2012
1       2012
2       2012
3       2012
4       2012
        ...
2926    2023
2927    2023
2928    2023
2929    2023
2930    2023
Name: Date, Length: 2931, dtype: int32

In [40]:
AAPL['Year'] = AAPL['Date'].dt.year
AAPL['Month'] = AAPL['Date'].dt.month
AAPL['day'] = AAPL['Date'].dt.day
AAPL.head()

,Date,Open,High,Low,Close,Adj Close,Volume,Year,Month,day
0,2012-01-03,14.621429,14.732143,14.607143,14.686786,12.466090,302220800,2012,1,3
1,2012-01-04,14.642857,14.810000,14.617143,14.765714,12.533089,260022000,2012,1,4
2,2012-01-05,14.819643,14.948214,14.738214,14.929643,12.672229,271269600,2012,1,5
3,2012-01-06,14.991786,15.098214,14.972143,15.085714,12.804703,318292800,2012,1,6
4,2012-01-09,15.196429,15.276786,15.048214,15.061786,12.784389,394024400,2012,1,9

In [41]:
# for문 사용

AAPL['Close'].iloc[1:] - AAPL['Close'].iloc[]

1        14.765714
2        14.929643
3        15.085714
4        15.061786
5        15.115714
           ...
2926    175.839996
2927    177.229996
2928    181.119995
2929    176.380005
2930    178.610001
Name: Close, Length: 2930, dtype: float64

In [42]:
AAPL['Close'].diff()

0            NaN
1       0.078928
2       0.163929
3       0.156071
4      -0.023928
          ...
2926    1.349991
2927    1.390000
2928    3.889999
2929   -4.739990
2930    2.229996
Name: Close, Length: 2931, dtype: float64

In [43]:
AAPL['Close'].pct_change()

0            NaN
1       0.005374
2       0.011102
3       0.010454
4      -0.001586
          ...
2926    0.007737
2927    0.007905
2928    0.021949
2929   -0.026170
2930    0.012643
Name: Close, Length: 2931, dtype: float64

In [44]:
AAPL['Close_shift1'] = AAPL['Close'].shift(1) # 한칸 내려서 새로운 표 생성
AAPL.head()

,Date,Open,High,Low,Close,Adj Close,Volume,Year,Month,day,Close_shift1
0,2012-01-03,14.621429,14.732143,14.607143,14.686786,12.466090,302220800,2012,1,3,NaN
1,2012-01-04,14.642857,14.810000,14.617143,14.765714,12.533089,260022000,2012,1,4,14.686786
2,2012-01-05,14.819643,14.948214,14.738214,14.929643,12.672229,271269600,2012,1,5,14.765714
3,2012-01-06,14.991786,15.098214,14.972143,15.085714,12.804703,318292800,2012,1,6,14.929643
4,2012-01-09,15.196429,15.276786,15.048214,15.061786,12.784389,394024400,2012,1,9,15.085714

## 이동 평균 vs 누적 평균

In [45]:
# 누적 평균

AAPL['ex_mean'] = AAPL['Close'].expanding().mean() #누적 평균
AAPL['MA5'] = AAPL['Close'].rolling(window=5).mean() #이동 평균 window size5
AAPL

,Date,Open,High,Low,Close,Adj Close,Volume,Year,Month,day,Close_shift1,ex_mean,MA5
0,2012-01-03,14.621429,14.732143,14.607143,14.686786,12.466090,302220800,2012,1,3,NaN,14.686786,NaN
1,2012-01-04,14.642857,14.810000,14.617143,14.765714,12.533089,260022000,2012,1,4,14.686786,14.726250,NaN
2,2012-01-05,14.819643,14.948214,14.738214,14.929643,12.672229,271269600,2012,1,5,14.765714,14.794048,NaN
3,2012-01-06,14.991786,15.098214,14.972143,15.085714,12.804703,318292800,2012,1,6,14.929643,14.866964,NaN
4,2012-01-09,15.196429,15.276786,15.048214,15.061786,12.784389,394024400,2012,1,9,15.085714,14.905929,14.905929
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2926,2023-08-21,175.070007,176.130005,173.740005,175.839996,175.839996,46311900,2023,8,21,174.490005,64.509729,175.670001
2927,2023-08-22,177.059998,177.679993,176.250000,177.229996,177.229996,42084200,2023,8,22,175.839996,64.548227,175.626001
2928,2023-08-23,178.520004,181.550003,178.330002,181.119995,181.119995,52722800,2023,8,23,177.229996,64.588026,176.535998
2929,2023-08-24,180.669998,181.100006,176.009995,176.380005,176.380005,54945800,2023,8,24,181.119995,64.626180,177.011999
2930,2023-08-25,177.380005,179.149994,175.820007,178.610001,178.610001,51418700,2023,8,25,176.380005,64.665069,177.835999